package Lesson23Questions;

public class Questions {
	// Что такое наследование?
	// Наследование - это механизм, в котором один класс приобретает свойство другого класса
	
	
	// Для чего нужен extends?
	// Он нужен для того чтобы унаследовать поля и методы другого класса
	
	// Что такое public?
	// public - этот модификатор доступен из любого места программы, независимо от пакета
	
	// Что такое private?
	// private - это самый строгий уровень доступа, доступен только в классе котором он объявлен
}
